# FabricationProductData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..FabricationProductData Property
GroupTypeId Class See Also
---
Fabrication Product Data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId FabricationProductData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationProductData As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationProductData {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace